In [1]:
import pandas as pd
import numpy as np

In [2]:
#读取titanic数据
titanic_survival= pd.read_csv('titanic_train.csv')
titanic_survival.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
#获取'age'列
age = titanic_survival['Age']
#打印前10个数据  观察发现存在缺失值
print age[0:10]
print '-----------------------------------------------'

#判断age中数据是为空
age_is_null = pd.isnull(age)
#空数据行数作为索引
age_null_true = age[age_is_null]

print age_null_true
print '-----------------------------------------------'

#空数据计数
count = len(age_null_true)
print count

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64
-----------------------------------------------
5     NaN
17    NaN
19    NaN
26    NaN
28    NaN
29    NaN
31    NaN
32    NaN
36    NaN
42    NaN
45    NaN
46    NaN
47    NaN
48    NaN
55    NaN
64    NaN
65    NaN
76    NaN
77    NaN
82    NaN
87    NaN
95    NaN
101   NaN
107   NaN
109   NaN
121   NaN
126   NaN
128   NaN
140   NaN
154   NaN
       ..
718   NaN
727   NaN
732   NaN
738   NaN
739   NaN
740   NaN
760   NaN
766   NaN
768   NaN
773   NaN
776   NaN
778   NaN
783   NaN
790   NaN
792   NaN
793   NaN
815   NaN
825   NaN
826   NaN
828   NaN
832   NaN
837   NaN
839   NaN
846   NaN
849   NaN
859   NaN
863   NaN
868   NaN
878   NaN
888   NaN
Name: Age, Length: 177, dtype: float64
-----------------------------------------------
177

In [9]:
#不做预处理  得到平均年龄  结果为nan
mean_age = sum(titanic_survival['Age']) / len(titanic_survival['Age'])
print mean_age

nan

In [13]:
#去除缺失值  只计算存在正确数据的平均值  
#一般选择用平均值进行缺失值的填充
corrcet_age = titanic_survival['Age'][age_is_null == False]
# corrcet_age.head()
#method 1  sum / len
# mean = sum(corrcet_age) / len(corrcet_age)
#method 2 mean()
mean = corrcet_age.mean()
print mean

29.69911764705882

In [15]:
#计算船舱等级对应船票的价格均值
#method 1 利用循环 索引 字典等
p_class = [1, 2, 3]
#定义空字典 key:value
fare_class = {}

for rank in p_class:
    p_class_row = titanic_survival[titanic_survival['Pclass'] == rank]
    class_fare = p_class_row['Fare']
    fare_mean = class_fare.mean()
    fare_class[rank] = fare_mean
print fare_class

{1: 84.1546875, 2: 20.662183152173913, 3: 13.675550101832993}

In [16]:
#method 2 利用pivot_table
fare_class = titanic_survival.pivot_table(index= 'Pclass', values='Fare', aggfunc=np.mean)
print fare_class

             Fare
Pclass
1       84.154687
2       20.662183
3       13.675550

In [18]:
#寻求乘客获救和船舱等级之间的关系 
#aggfunc默认为mean
survived = titanic_survival.pivot_table( index = 'Pclass', values = 'Survived')
print survived

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

In [20]:
#不同船舱等级乘客的平均年龄
class_age = titanic_survival.pivot_table(index = 'Pclass', values = 'Age', aggfunc=np.mean)
print class_age

              Age
Pclass
1       38.233441
2       29.877630
3       25.140620

In [21]:
#不同登船点 对应的总的船票价格及获救人数
port = titanic_survival.pivot_table(index = 'Embarked', values = ['Fare', 'Survived'], aggfunc=np.sum)
print port

                Fare  Survived
Embarked
C         10072.2962        93
Q          1022.2543        30
S         17439.3988       217

In [35]:
#drop fill 去掉缺失值以及填充缺失值
titanic_survival.loc[4:7]
# new = titanic_survival.dropna(axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [39]:
#直接丢弃Age中缺失值
#axis = 0对列进行操作  subset指定'Age'这一列
new_titanic_suvival = titanic_survival.dropna(axis = 0,subset=['Age'])
new_titanic_suvival.loc[4:7]
# print new_titanic_suvival.shape

(714, 12)

In [38]:
#根据索引得到某行某列的具体值
row6_age = titanic_survival.loc[6, 'Age']
row6_age

54.0

In [49]:
#年龄排序  逆序更改年龄排序 但是index不变化
new_titanic_suvival = titanic_survival.sort_values('Age', ascending=False )
print  new_titanic_suvival.head()
print '------------------------------------------------------'

#更新index,让其从0开始排序
new_titanic_suvival_resetindex = new_titanic_suvival.reset_index(drop = True)
print new_titanic_suvival_resetindex.head()

     PassengerId  Survived  Pclass                                  Name  \
630          631         1       1  Barkworth, Mr. Algernon Henry Wilson
851          852         0       3                   Svensson, Mr. Johan
493          494         0       1               Artagaveytia, Mr. Ramon
96            97         0       1             Goldschmidt, Mr. George B
116          117         0       3                  Connors, Mr. Patrick

      Sex   Age  SibSp  Parch    Ticket     Fare Cabin Embarked
630  male  80.0      0      0     27042  30.0000   A23        S
851  male  74.0      0      0    347060   7.7750   NaN        S
493  male  71.0      0      0  PC 17609  49.5042   NaN        C
96   male  71.0      0      0  PC 17754  34.6542    A5        C
116  male  70.5      0      0    370369   7.7500   NaN        Q
------------------------------------------------------
   PassengerId  Survived  Pclass                                  Name   Sex  \
0          631         1       1  Barkworth, Mr. Algernon Henry Wilson  male
1          852         0       3                   Svensson, Mr. Johan  male
2          494         0       1               Artagaveytia, Mr. Ramon  male
3           97         0       1             Goldschmidt, Mr. George B  male
4          117         0       3                  Connors, Mr. Patrick  male

    Age  SibSp  Parch    Ticket     Fare Cabin Embarked
0  80.0      0      0     27042  30.0000   A23        S
1  74.0      0      0    347060   7.7750   NaN        S
2  71.0      0      0  PC 17609  49.5042   NaN        C
3  71.0      0      0  PC 17754  34.6542    A5        C
4  70.5      0      0    370369   7.7500   NaN        Q

In [51]:
#自定义函数  
#返回第100行数据
def hundredth_row(columns):
    hundredth_item = columns.loc[99]
    return hundredth_item

#观察发现  passengerid为100 
#使用apply调用函数 
data = titanic_survival.apply(hundredth_row)
data

PassengerId                  100
Survived                       0
Pclass                         2
Name           Kantor, Mr. Sinai
Sex                         male
Age                           34
SibSp                          1
Parch                          0
Ticket                    244367
Fare                          26
Cabin                        NaN
Embarked                       S
dtype: object

In [53]:
#自定义函数统计titanic数据中null数据的长度
def len_null(columns):
    #得到空数据的bool型
    column_null = pd.isnull(columns)
    #以bool作为索引得到null数据
    null = columns[column_null]
    #统计长度
    return len(null)
    
count = titanic_survival.apply(len_null)
count

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [58]:
#定义函数 对乘客年龄进行划分
#如果为空 则返回unknown 如果大于18岁视为成年人 
def age_label(row):
    age = row['Age']
    
    if pd.isnull(age):
        return 'unknown'
    elif age < 18:
        return 'minor'
    else:
        return 'adult'
    
age_label = titanic_survival.apply(age_label,axis = 1)

titanic_survival['age_label'] = age_label
list = ['Age', 'age_label']
titanic_survival[list].loc[0:10]

     Age age_label
0   22.0     adult
1   38.0     adult
2   26.0     adult
3   35.0     adult
4   35.0     adult
5    NaN   unknown
6   54.0     adult
7    2.0     minor
8   27.0     adult
9   14.0     minor
10   4.0     minor

In [60]:
#得到age_label和乘客存活数之间的关系
titanic_survival.pivot_table(index = 'age_label',values='Survived')

           Survived
age_label
adult      0.381032
minor      0.539823
unknown    0.293785